//ergasia1  pls50  eirini zoumpounelli  thema 3
//ΕΡΓΑΣΙΑ1 ΠΛΣ50 ΕΙΡΗΝΗ ΖΟΥΜΠΟΥΝΕΛΛΗ ΘΕΜΑ 3

#include <stdio.h>

const int duo=2;

int main()
{
int d ,c;
float b;

do{
    printf("dwse mou thetiko akeraio arithmo\n");
    scanf("%f", &b);
    b=b*10;
    c=b;
    /*ΕΛέγχω αν ο αριθμός που δίνει ο χρήστησ είναι δεκαδικός. Γιατί αν είναι και δεν είχα βάλει αυτόν το έλχο θα έκανε κανονικά τον υπολογισμό αλλά για το ακέραιο μέροσ.
    Επίσης, θέλει προσοχή με τη χρήση των μεταβήτών, που είναι int και που float*/

    if (c<0||((c%10)!=0)){
        printf("lathos ");
    }
    else {c=c/10;
        while(c!=0){
            d=((c%duo==1)? 1 : 0 );
            c=c/duo;
                if (d==1){
                    putchar('1');
                }
                else if (d==0){
                    putchar('0');
                }
        }
    printf("\n");
    }
}
while(b!=0);
return 0;
}

/*Το πρόγραμμα έτρεχε χωρίσ πρόβλημα. όταν το πληκτρολόγιο μου ήταν γυρισμένο στα ελληνικά και έδινα δεκαδικό μου εμφάνιζε συνέχεια χωρισ να σταματέι το μήνυμα λάθουσ. επίσησ αμ δώσει δύο αριθμους με κενό ανάμεσα εμφανίζει και των δύο την αναπαράσταση αλλα σαν να εχω κάνει 2 φορέσ τη διαδικασία*/
